# Ultralytics YOLO26n + RepViT-C3k2 融合模型配置
# =============================================
# 基于 yolo26s-repvit.yaml，将规模从 s 切换为 n 以适配边缘部署
#
# 变更说明 (相比 yolo26s-repvit.yaml):
#   - scale 从 s [0.50, 0.50, 1024] 改为 n [0.50, 0.25, 1024]
#   - width=0.25 使所有通道数减半，大幅降低参数量和计算量
#   - 结构完全一致: backbone 层 2/4/8 仍为 RepViTC3k2
#   - 目标: 部署到旭日X3派 (BPU 5TOPS, ARM 4核)
#
# 预期规模:
#   - Params: ~2.4M (vs s版 9.5M)
#   - GFLOPs: ~5.4G (vs s版 20.7G)
#
# 使用方式:
#   from ultralytics import YOLO
#   model = YOLO("yolo26n-repvit.yaml")
#   model.train(data="data.yaml", epochs=200, imgsz=640)

nc: 80
end2end: True
reg_max: 1
scales:
  # [depth, width, max_channels]
  # 仅使用 n 规模（轻量版，面向边缘部署）
  n: [0.50, 0.25, 1024]   # ~2.4M params, ~5.4 GFLOPs

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, RepViTC3k2, [256, False, 0.5, 7]]  # 2  ← 创新: RepViT [c2, shortcut, e, kernel_size]
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 2, RepViTC3k2, [512, False, 0.5, 7]]  # 4  ← 创新: RepViT
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
  - [-1, 2, RepViTC3k2, [1024, False, 0.5, 7]]    # 8  ← 创新: RepViT
  - [-1, 1, SPPF, [1024, 5, 3, True]]  # 9
  - [-1, 2, C2PSA, [1024]]              # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]          # 12: Cat Backbone P4
  - [-1, 2, C3k2, [512, True]]          # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]          # 15: Cat Backbone P3
  - [-1, 2, C3k2, [256, True]]          # 16 P3/8

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]         # 18: Cat Head P4
  - [-1, 2, C3k2, [512, True]]          # 19 P4/16

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]         # 21: Cat Head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]]  # 22 P5/32

  - [[16, 19, 22], 1, Detect, [nc]]    # Detect(P3, P4, P5)
